{"translation-revision-date":"2024-02-19 09:49:17+0000","generator":"GlotPress\/4.0.1","domain":"messages","locale_data":{"messages":{"":{"domain":"messages","plural-forms":"nplurals=3; plural=(n % 10 == 1 && n % 100 != 11) ? 0 : ((n % 10 >= 2 && n % 10 <= 4 && (n % 100 < 12 || n % 100 > 14)) ? 1 : 2);","lang":"ru"},"Ascending":["По возрастанию"],"Date modified":["Дата изменения"],"Descending":["По убыванию"],"Menu Order":["Порядок меню"],"Order by":["Упорядочить по"]," Determines the number of results to display. Default returns all available courses.":[" Определяет кол-во результатов для отображения. По умолчанию выводятся все доступные курсы."],"Random":["Случайно"],"Display courses in ascending or descending order.":["Отображение курсов в порядке возрастания или убывания."],"Per Page":["На страницу"],"Search available courses":["Поиск доступных курсов"],"Show only my courses":["Показать только мои курсы"],"Display only specific course(s). You can select multiple courses.":["Отображение только определенного курса (ов). Можно выбрать несколько курсов."],"Show only courses the current student is enrolled in. By default (\"no\") shows courses regardless of enrollment.":["Показывать только курсы, на которые зачислен текущий студент. По умолчанию («no (нет)») отображаются курсы независимо от зачисления."],"Determines which field is used to order courses in the courses list.":["Определяет, какое поле используется для упорядочивания курсов в списке курсов."],"Whether or not courses with a \"hidden\" visibility should be included. Defaults to \"yes\" (hidden courses displayed). Switch to \"no\" to exclude hidden courses.":["Включать или не включать курсы со статусом \"скрытый\". По умолчанию \"да\" (скрытые курсы отображаются). Переключите значение на \"нет\", чтобы исключить скрытые курсы."],"Loading":["Загрузка"],"Select course":["Выбрать курс"],"Category":["Рубрика"],"- All -":["- Все -"],"Courses Settings":["Настройки курсов"],"Error loading content. Please check block settings are valid. This block will not be displayed.":["Ошибка при загрузке содержимого. Проверьте правильность настроек блока. Этот блок не будет отображаться."],"Inherit from current %s":["Наследовать от текущего %s"],"Show hidden courses?":["Показать скрытые курсы?"],"No courses found matching your selection. This block will not be displayed.":["Курсов, соответствующих вашему выбору, не найдено. Этот блок не будет отображаться."],"Display courses from a specific Course Category only.":["Отображать курсы только из определенной рубрики курсов."],"Author":["Автор"],"Any":["Любой"],"ID":["ID"],"Name":["Имя"],"Cancelled":["Отменено"],"Expired":["Срок истек"],"Title":["Название"],"Enrolled":["Зачислен"],"Courses":["Курсы"],"No":["Нет"],"Date":["Дата"],"Order":["Order"]}},"comment":{"reference":"blocks\/courses\/index.js"}}